{
  "compendiumId": "dnd5e-srd-monsters-cr-11-plus",
  "name": "CR 11+ Monsters",
  "templateId": "dnd5e-monster",
  "source": "SRD 5.1",
  "entries": [
    {
      "id": "behir",
      "name": "Behir",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/tie.svg",
      "description": "The serpentine behir crawls along floors and clambers up walls to reach its prey. A behir's dozen legs are arrayed in pairs along its long, serpentine body.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "monstrosity",
        "alignment": "neutral evil",
        "armor_class": "17 (natural armor)",
        "hp_formula": "168 (16d12 + 64)",
        "speed": "50 ft., climb 40 ft.",
        "strength": 23,
        "dexterity": 16,
        "constitution": 18,
        "intelligence": 7,
        "wisdom": 14,
        "charisma": 12,
        "skills": "Perception +6, Stealth +7",
        "damage_immunities": "lightning",
        "senses": "darkvision 90 ft., passive Perception 16",
        "languages": "Draconic",
        "challenge_rating": "11",
        "experience_points": 7200,
        "actions": "Multiattack. The behir makes two attacks: one with its bite and one to constrict.\n\nBite. Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage.\n\nConstrict. Melee Weapon Attack: +10 to hit, reach 5 ft., one Large or smaller creature. Hit: 17 (2d10 + 6) bludgeoning damage plus 17 (2d10 + 6) slashing damage. The target is grappled (escape DC 16) if the behir isn't already constricting a creature, and the target is restrained until this grapple ends.\n\nLightning Breath (Recharge 5–6). The behir exhales a line of lightning that is 20 feet long and 5 feet wide. Each creature in that line must make a DC 16 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.\n\nSwallow. The behir makes one bite attack against a Medium or smaller target it is grappling. If the attack hits, the target is also swallowed, and the grapple ends. While swallowed, the target is blinded and restrained, it has total cover against attacks and other effects outside the behir, and it takes 21 (6d6) acid damage at the start of each of the behir's turns. A behir can have only one creature swallowed at a time. If the behir takes 30 damage or more on a single turn from the swallowed creature, the behir must succeed on a DC 14 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 10 feet of the behir. If the behir dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 15 feet of movement, exiting prone."
      }
    },
    {
      "id": "djinni",
      "name": "Djinni",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/djinn.svg",
      "description": "Proud, sensuous genies from the Elemental Plane of Air, the djinn are attractive, tall, well-muscled humanoids with blue skin and dark eyes.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "elemental",
        "alignment": "chaotic good",
        "armor_class": "17 (natural armor)",
        "hp_formula": "161 (14d10 + 84)",
        "speed": "30 ft., fly 90 ft.",
        "strength": 21,
        "dexterity": 15,
        "constitution": 22,
        "intelligence": 15,
        "wisdom": 16,
        "charisma": 20,
        "saving_throws": "Dex +6, Wis +7, Cha +9",
        "damage_immunities": "lightning, thunder",
        "senses": "darkvision 120 ft., passive Perception 13",
        "languages": "Auran",
        "challenge_rating": "11",
        "experience_points": 7200,
        "traits": "Elemental Demise. If the djinni dies, its body disintegrates into a warm breeze, leaving behind only equipment the djinni was wearing or carrying.\n\nInnate Spellcasting. The djinni's innate spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nAt will: detect evil and good, detect magic, thunderwave\n3/day each: create food and water (can create wine instead of water), tongues, wind walk\n1/day each: conjure elemental (air elemental only), creation, gaseous form, invisibility, major image, plane shift",
        "actions": "Multiattack. The djinni makes three scimitar attacks.\n\nScimitar. Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage plus 3 (1d6) lightning or thunder damage (djinni's choice).\n\nCreate Whirlwind. A 5-foot-radius, 30-foot-tall cylinder of swirling air magically forms on a point the djinni can see within 120 feet of it. The whirlwind lasts as long as the djinni maintains concentration (as if concentrating on a spell). Any creature but the djinni that enters the whirlwind must succeed on a DC 18 Strength saving throw or be restrained by it. The djinni can move the whirlwind up to 60 feet as an action, and creatures restrained by the whirlwind move with it. The whirlwind ends if the djinni loses sight of it. A creature can use its action to free a creature restrained by the whirlwind, including itself, by succeeding on a DC 18 Strength check. If the check succeeds, the creature is no longer restrained and moves to the nearest space outside the whirlwind."
      }
    },
    {
      "id": "efreeti",
      "name": "Efreeti",
      "img": "icons/creatures/elementals/efreeti.webp",
      "description": "Large and powerfully built genies from the Elemental Plane of Fire, the efreet are masters of flame, immune to fire and able to create it on a whim.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "elemental",
        "alignment": "lawful evil",
        "armor_class": "17 (natural armor)",
        "hp_formula": "200 (16d10 + 112)",
        "speed": "40 ft., fly 60 ft.",
        "strength": 22,
        "dexterity": 12,
        "constitution": 24,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 16,
        "saving_throws": "Int +7, Wis +6, Cha +7",
        "damage_immunities": "fire",
        "senses": "darkvision 120 ft., passive Perception 12",
        "languages": "Ignan",
        "challenge_rating": "11",
        "experience_points": 7200,
        "traits": "Elemental Demise. If the efreeti dies, its body disintegrates in a flash of fire and puff of smoke, leaving behind only equipment the efreeti was wearing or carrying.\n\nInnate Spellcasting. The efreeti's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nAt will: detect magic\n3/day: enlarge/reduce, tongues\n1/day each: conjure elemental (fire elemental only), gaseous form, invisibility, major image, plane shift, wall of fire",
        "actions": "Multiattack. The efreeti makes two scimitar attacks or uses its Hurl Flame twice.\n\nScimitar. Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage plus 7 (2d6) fire damage.\n\nHurl Flame. Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 17 (5d6) fire damage."
      }
    },
    {
      "id": "gynosphinx",
      "name": "Gynosphinx",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/tie.svg",
      "description": "Gynosphinxes are female sphinxes who test the courage and aptitude of those who seek their knowledge or pass through their territory.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "monstrosity",
        "alignment": "lawful neutral",
        "armor_class": "17 (natural armor)",
        "hp_formula": "136 (16d10 + 48)",
        "speed": "40 ft., fly 60 ft.",
        "strength": 18,
        "dexterity": 15,
        "constitution": 16,
        "intelligence": 18,
        "wisdom": 18,
        "charisma": 18,
        "skills": "Arcana +12, History +12, Perception +8, Religion +8",
        "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "psychic",
        "condition_immunities": "charmed, frightened",
        "senses": "truesight 120 ft., passive Perception 18",
        "languages": "Common, Sphinx",
        "challenge_rating": "11",
        "experience_points": 7200,
        "traits": "Inscrutable. The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. Wisdom (Insight) checks made to ascertain the sphinx's intentions or sincerity have disadvantage.\n\nMagic Weapons. The sphinx's weapon attacks are magical.\n\nSpellcasting. The sphinx is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 16, +8 to hit with spell attacks). It requires no material components to cast its spells. The sphinx has the following wizard spells prepared:\n\nCantrips (at will): mage hand, minor illusion, prestidigitation\n1st level (4 slots): detect magic, identify, shield\n2nd level (3 slots): darkness, locate object, suggestion\n3rd level (3 slots): dispel magic, remove curse, tongues\n4th level (3 slots): banishment, greater invisibility\n5th level (1 slot): legend lore",
        "actions": "Multiattack. The sphinx makes two claw attacks.\n\nClaw. Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
        "legendary_actions": "The sphinx can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The sphinx regains spent legendary actions at the start of its turn.\n\nClaw Attack. The sphinx makes one claw attack.\n\nTeleport (Costs 2 Actions). The sphinx magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see.\n\nCast a Spell (Costs 3 Actions). The sphinx casts a spell from its list of prepared spells, using a spell slot as normal."
      }
    },
    {
      "id": "horned-devil",
      "name": "Horned Devil",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/devil-mask.svg",
      "description": "Horned devils are lazy to a fault. They make ideal sentries and guardians, needing little motivation to stay at their posts.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "fiend (devil)",
        "alignment": "lawful evil",
        "armor_class": "18 (natural armor)",
        "hp_formula": "178 (17d10 + 85)",
        "speed": "20 ft., fly 60 ft.",
        "strength": 22,
        "dexterity": 17,
        "constitution": 21,
        "intelligence": 12,
        "wisdom": 16,
        "charisma": 17,
        "saving_throws": "Str +10, Dex +7, Wis +7, Cha +7",
        "damage_resistances": "cold; bludgeoning, piercing, and slashing from nonmagical attacks not made with silvered weapons",
        "damage_immunities": "fire, poison",
        "condition_immunities": "poisoned",
        "senses": "darkvision 120 ft., passive Perception 13",
        "languages": "Infernal, telepathy 120 ft.",
        "challenge_rating": "11",
        "experience_points": 7200,
        "traits": "Devil's Sight. Magical darkness doesn't impede the devil's darkvision.\n\nMagic Resistance. The devil has advantage on saving throws against spells and other magical effects.",
        "actions": "Multiattack. The devil makes three melee attacks: two with its fork and one with its tail. It can use Hurl Flame in place of any melee attack.\n\nFork. Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 15 (2d8 + 6) piercing damage.\n\nTail. Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 10 (1d8 + 6) piercing damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 17 Constitution saving throw or lose 10 (3d6) hit points at the start of each of its turns due to an infernal wound. Each time the devil hits the wounded target with this attack, the damage dealt by the wound increases by 10 (3d6). Any creature can take an action to stanch the wound with a successful DC 12 Wisdom (Medicine) check. The wound also closes if the target receives magical healing.\n\nHurl Flame. Ranged Spell Attack: +7 to hit, range 150 ft., one target. Hit: 14 (4d6) fire damage. If the target is a flammable object that isn't being worn or carried, it also catches fire."
      }
    },
    {
      "id": "roc",
      "name": "Roc",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/rock.svg",
      "description": "A roc is an eagle of tremendous size, able to carry off elephants and other large creatures in its talons.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "monstrosity",
        "alignment": "unaligned",
        "armor_class": "15 (natural armor)",
        "hp_formula": "248 (16d20 + 80)",
        "speed": "20 ft., fly 120 ft.",
        "strength": 28,
        "dexterity": 10,
        "constitution": 20,
        "intelligence": 3,
        "wisdom": 10,
        "charisma": 9,
        "saving_throws": "Dex +4, Con +9, Wis +4, Cha +3",
        "skills": "Perception +4",
        "senses": "passive Perception 14",
        "languages": "—",
        "challenge_rating": "11",
        "experience_points": 7200,
        "traits": "Keen Sight. The roc has advantage on Wisdom (Perception) checks that rely on sight.",
        "actions": "Multiattack. The roc makes two attacks: one with its beak and one with its talons.\n\nBeak. Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 27 (4d8 + 9) piercing damage.\n\nTalons. Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 23 (4d6 + 9) slashing damage, and the target is grappled (escape DC 19). Until this grapple ends, the target is restrained, and the roc can't use its talons on another target."
      }
    },
    {
      "id": "adult-white-dragon",
      "name": "Adult White Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The smallest and weakest of the chromatic dragons, white dragons are nonetheless ferocious, bestial predators.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "chaotic evil",
        "armor_class": "18 (natural armor)",
        "hp_formula": "200 (16d12 + 96)",
        "speed": "40 ft., burrow 30 ft., fly 80 ft., swim 40 ft.",
        "strength": 22,
        "dexterity": 10,
        "constitution": 22,
        "intelligence": 8,
        "wisdom": 12,
        "charisma": 12,
        "saving_throws": "Dex +5, Con +11, Wis +6, Cha +6",
        "skills": "Perception +11, Stealth +5",
        "damage_immunities": "cold",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21",
        "languages": "Common, Draconic",
        "challenge_rating": "13",
        "experience_points": 10000,
        "traits": "Ice Walk. The dragon can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement.\n\nLegendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 4 (1d8) cold damage.\n\nClaw. Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\nTail. Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 14 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nCold Breath (Recharge 5–6). The dragon exhales an icy blast in a 60-foot cone. Each creature in that area must make a DC 19 Constitution saving throw, taking 54 (12d8) cold damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "adult-black-dragon",
      "name": "Adult Black Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most evil-tempered and vile of the chromatic dragons, black dragons collect the wreckage and treasures of fallen peoples.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "chaotic evil",
        "armor_class": "19 (natural armor)",
        "hp_formula": "195 (17d12 + 85)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 23,
        "dexterity": 14,
        "constitution": 21,
        "intelligence": 14,
        "wisdom": 13,
        "charisma": 17,
        "saving_throws": "Dex +7, Con +10, Wis +6, Cha +8",
        "skills": "Perception +11, Stealth +7",
        "damage_immunities": "acid",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21",
        "languages": "Common, Draconic",
        "challenge_rating": "14",
        "experience_points": 11500,
        "traits": "Amphibious. The dragon can breathe air and water.\n\nLegendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 4 (1d8) acid damage.\n\nClaw. Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\nTail. Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nAcid Breath (Recharge 5–6). The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "adult-green-dragon",
      "name": "Adult Green Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most cunning and treacherous of true dragons, green dragons use misdirection and trickery to get the upper hand against their enemies.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "lawful evil",
        "armor_class": "19 (natural armor)",
        "hp_formula": "207 (18d12 + 90)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 23,
        "dexterity": 12,
        "constitution": 21,
        "intelligence": 18,
        "wisdom": 15,
        "charisma": 17,
        "saving_throws": "Dex +6, Con +10, Wis +7, Cha +8",
        "skills": "Deception +8, Insight +7, Perception +12, Persuasion +8, Stealth +6",
        "damage_immunities": "poison",
        "condition_immunities": "poisoned",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "15",
        "experience_points": 13000,
        "traits": "Amphibious. The dragon can breathe air and water.\n\nLegendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 7 (2d6) poison damage.\n\nClaw. Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\nTail. Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nPoison Breath (Recharge 5–6). The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 56 (16d6) poison damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "adult-blue-dragon",
      "name": "Adult Blue Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "Vain and territorial, blue dragons soar through the skies above deserts, preying on caravans and plundering herds and settlements.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "lawful evil",
        "armor_class": "19 (natural armor)",
        "hp_formula": "225 (18d12 + 108)",
        "speed": "40 ft., burrow 30 ft., fly 80 ft.",
        "strength": 25,
        "dexterity": 10,
        "constitution": 23,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 19,
        "saving_throws": "Dex +5, Con +11, Wis +7, Cha +9",
        "skills": "Perception +12, Stealth +5",
        "damage_immunities": "lightning",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "16",
        "experience_points": 15000,
        "traits": "Legendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 5 (1d10) lightning damage.\n\nClaw. Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.\n\nTail. Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nLightning Breath (Recharge 5–6). The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "adult-red-dragon",
      "name": "Adult Red Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most covetous of the true dragons, red dragons tirelessly seek to increase their treasure hoards.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "chaotic evil",
        "armor_class": "19 (natural armor)",
        "hp_formula": "256 (19d12 + 133)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "strength": 27,
        "dexterity": 10,
        "constitution": 25,
        "intelligence": 16,
        "wisdom": 13,
        "charisma": 21,
        "saving_throws": "Dex +6, Con +13, Wis +7, Cha +11",
        "skills": "Perception +13, Stealth +6",
        "damage_immunities": "fire",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
        "languages": "Common, Draconic",
        "challenge_rating": "17",
        "experience_points": 18000,
        "traits": "Legendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 7 (2d6) fire damage.\n\nClaw. Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\nTail. Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nFire Breath (Recharge 5–6). The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "storm-giant",
      "name": "Storm Giant",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/giant.svg",
      "description": "Storm giants are contemplative seers that live in places far removed from mortal civilization. Most have pale purple-gray skin and hair, and glittering emerald eyes.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "giant",
        "alignment": "chaotic good",
        "armor_class": "16 (scale mail)",
        "hp_formula": "230 (20d12 + 100)",
        "speed": "50 ft., swim 50 ft.",
        "strength": 29,
        "dexterity": 14,
        "constitution": 20,
        "intelligence": 16,
        "wisdom": 18,
        "charisma": 18,
        "saving_throws": "Str +14, Con +10, Wis +9, Cha +9",
        "skills": "Arcana +8, Athletics +14, History +8, Perception +9",
        "damage_resistances": "cold",
        "damage_immunities": "lightning, thunder",
        "senses": "passive Perception 19",
        "languages": "Common, Giant",
        "challenge_rating": "13",
        "experience_points": 10000,
        "traits": "Amphibious. The giant can breathe air and water.\n\nInnate Spellcasting. The giant's innate spellcasting ability is Charisma (spell save DC 17). It can innately cast the following spells, requiring no material components:\n\nAt will: detect magic, feather fall, levitate, light\n3/day each: control weather, water breathing",
        "actions": "Multiattack. The giant makes two greatsword attacks.\n\nGreatsword. Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 30 (6d6 + 9) slashing damage.\n\nRock. Ranged Weapon Attack: +14 to hit, range 60/240 ft., one target. Hit: 35 (4d12 + 9) bludgeoning damage.\n\nLightning Strike (Recharge 5–6). The giant hurls a magical lightning bolt at a point it can see within 500 feet of it. Each creature within 10 feet of that point must make a DC 17 Dexterity saving throw, taking 54 (12d8) lightning damage on a failed save, or half as much damage on a successful one."
      }
    },
    {
      "id": "vampire",
      "name": "Vampire",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/vampire-cape.svg",
      "description": "Awakened to an endless night, vampires hunger for the life they have lost and sate that hunger by drinking the blood of the living.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "medium",
        "type": "undead (shapechanger)",
        "alignment": "lawful evil",
        "armor_class": "16 (natural armor)",
        "hp_formula": "144 (17d8 + 68)",
        "speed": "30 ft.",
        "strength": 18,
        "dexterity": 18,
        "constitution": 18,
        "intelligence": 17,
        "wisdom": 15,
        "charisma": 18,
        "saving_throws": "Dex +9, Wis +7, Cha +9",
        "skills": "Perception +7, Stealth +9",
        "damage_resistances": "necrotic; bludgeoning, piercing, and slashing from nonmagical attacks",
        "senses": "darkvision 120 ft., passive Perception 17",
        "languages": "the languages it knew in life",
        "challenge_rating": "13",
        "experience_points": 10000,
        "traits": "Shapechanger. If the vampire isn't in sunlight or running water, it can use its action to polymorph into a Tiny bat or a Medium cloud of mist, or back into its true form. While in bat form, the vampire can't speak, its walking speed is 5 feet, and it has a flying speed of 30 feet. Its statistics, other than its size and speed, are unchanged. Anything it is wearing transforms with it, but nothing it is carrying does. It reverts to its true form if it dies. While in mist form, the vampire can't take any actions, speak, or manipulate objects. It is weightless, has a flying speed of 20 feet, can hover, and can enter a hostile creature's space and stop there. In addition, if air can pass through a space, the mist can do so without squeezing, and it can't pass through water. It has advantage on Strength, Dexterity, and Constitution saving throws, and it is immune to all nonmagical damage, except the damage it takes from sunlight.\n\nLegendary Resistance (3/Day). If the vampire fails a saving throw, it can choose to succeed instead.\n\nMisty Escape. When it drops to 0 hit points outside its resting place, the vampire transforms into a cloud of mist (as in the Shapechanger trait) instead of falling unconscious, provided that it isn't in sunlight or running water. If it can't transform, it is destroyed. While it has 0 hit points in mist form, it can't revert to its vampire form, and it must reach its resting place within 2 hours or be destroyed. Once in its resting place, it reverts to its vampire form. It is then paralyzed until it regains at least 1 hit point. After spending 1 hour in its resting place with 0 hit points, it regains 1 hit point.\n\nRegenerationThe vampire regains 20 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn.\n\nSpider Climb. The vampire can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n\nVampire Weaknesses. The vampire has the following flaws:\n\nForbiddance. The vampire can't enter a residence without an invitation from one of the occupants.\n\nHarmed by Running Water. The vampire takes 20 acid damage if it ends its turn in running water.\n\nStake to the Heart. If a piercing weapon made of wood is driven into the vampire's heart while the vampire is incapacitated in its resting place, the vampire is paralyzed until the stake is removed.\n\nSunlight Hypersensitivity. The vampire takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks.",
        "actions": "Multiattack (Vampire Form Only). The vampire makes two attacks, only one of which can be a bite attack.\n\nUnarmed Strike (Vampire Form Only). Melee Weapon Attack: +9 to hit, reach 5 ft., one creature. Hit: 8 (1d8 + 4) bludgeoning damage. Instead of dealing damage, the vampire can grapple the target (escape DC 18).\n\nBite (Bat or Vampire Form Only). Melee Weapon Attack: +9 to hit, reach 5 ft., one willing creature, or a creature that is grappled by the vampire, incapacitated, or restrained. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain in this way and then buried in the ground rises the following night as a vampire spawn under the vampire's control.\n\nCharm. The vampire targets one humanoid it can see within 30 feet of it. If the target can see the vampire, the target must succeed on a DC 17 Wisdom saving throw against this magic or be charmed by the vampire. The charmed target regards the vampire as a trusted friend to be heeded and protected. Although the target isn't under the vampire's control, it takes the vampire's requests or actions in the most favorable way it can, and it is a willing target for the vampire's bite attack. Each time the vampire or the vampire's companions do anything harmful to the target, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until the vampire is destroyed, is on a different plane of existence than the target, or takes a bonus action to end the effect.\n\nChildren of the Night (1/Day). The vampire magically calls 2d4 swarms of bats or rats, provided that the sun isn't up. While outdoors, the vampire can call 3d6 wolves instead. The called creatures arrive in 1d4 rounds, acting as allies of the vampire and obeying its spoken commands. The beasts remain for 1 hour, until the vampire dies, or until the vampire dismisses them as a bonus action.",
        "legendary_actions": "The vampire can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The vampire regains spent legendary actions at the start of its turn.\n\nMove. The vampire moves up to its speed without provoking opportunity attacks.\n\nUnarmed Strike. The vampire makes one unarmed strike.\n\nBite (Costs 2 Actions). The vampire makes one bite attack."
      }
    },
    {
      "id": "archmage",
      "name": "Archmage",
      "img": "icons/creatures/humanoids/archmage.webp",
      "description": "Archmages are powerful (and usually quite old) spellcasters dedicated to the study of the arcane arts.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "medium",
        "type": "humanoid (any race)",
        "alignment": "any alignment",
        "armor_class": "12 (15 with mage armor)",
        "hp_formula": "99 (18d8 + 18)",
        "speed": "30 ft.",
        "strength": 10,
        "dexterity": 14,
        "constitution": 12,
        "intelligence": 20,
        "wisdom": 15,
        "charisma": 16,
        "saving_throws": "Int +9, Wis +6",
        "skills": "Arcana +13, History +13",
        "damage_resistances": "damage from spells; nonmagical bludgeoning, piercing, and slashing (from stoneskin)",
        "senses": "passive Perception 12",
        "languages": "any six languages",
        "challenge_rating": "12",
        "experience_points": 8400,
        "traits": "Magic Resistance. The archmage has advantage on saving throws against spells and other magical effects.\n\nSpellcasting. The archmage is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). The archmage can cast disguise self and invisibility at will and has the following wizard spells prepared:\n\nCantrips (at will): fire bolt, light, mage hand, prestidigitation, shocking grasp\n1st level (4 slots): detect magic, identify, mage armor*, magic missile\n2nd level (3 slots): detect thoughts, mirror image, misty step\n3rd level (3 slots): counterspell, fly, lightning bolt\n4th level (3 slots): banishment, fire shield, stoneskin*\n5th level (3 slots): cone of cold, scrying, wall of force\n6th level (1 slot): globe of invulnerability\n7th level (1 slot): teleport\n8th level (1 slot): mind blank*\n9th level (1 slot): time stop\n\n*The archmage casts these spells on itself before combat.",
        "actions": "Dagger. Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
      }
    },
    {
      "id": "lich",
      "name": "Lich",
      "img": "icons/creatures/undead/lich.webp",
      "description": "A lich is created when a powerful wizard or other spellcaster binds their soul to an object called a phylactery. This dark transformation grants the lich immortality and immense magical power.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "medium",
        "type": "undead",
        "alignment": "any evil alignment",
        "armor_class": "17 (natural armor)",
        "hp_formula": "135 (18d8 + 54)",
        "speed": "30 ft.",
        "strength": 11,
        "dexterity": 16,
        "constitution": 16,
        "intelligence": 20,
        "wisdom": 14,
        "charisma": 16,
        "saving_throws": "Con +10, Int +12, Wis +9",
        "skills": "Arcana +18, History +12, Insight +9, Perception +9",
        "damage_resistances": "cold, lightning, necrotic",
        "damage_immunities": "poison; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
        "senses": "truesight 120 ft., passive Perception 19",
        "languages": "Common plus up to five other languages",
        "challenge_rating": "21",
        "experience_points": 33000,
        "traits": "Legendary Resistance (3/Day). If the lich fails a saving throw, it can choose to succeed instead.\n\nRejuvenation. If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery.\n\nTurn Resistance. The lich has advantage on saving throws against any effect that turns undead.\n\nSpellcasting. The lich is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks). The lich has the following wizard spells prepared:\n\nCantrips (at will): mage hand, prestidigitation, ray of frost\n1st level (4 slots): detect magic, magic missile, shield, thunderwave\n2nd level (3 slots): acid arrow, detect thoughts, invisibility, mirror image\n3rd level (3 slots): animate dead, counterspell, dispel magic, fireball\n4th level (3 slots): blight, dimension door\n5th level (3 slots): cloudkill, scrying\n6th level (1 slot): disintegrate, globe of invulnerability\n7th level (1 slot): finger of death, plane shift\n8th level (1 slot): dominate monster, power word stun\n9th level (1 slot): power word kill",
        "actions": "Paralyzing Touch. Melee Spell Attack: +12 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "legendary_actions": "The lich can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The lich regains spent legendary actions at the start of its turn.\n\nCantrip. The lich casts a cantrip.\n\nParalyzing Touch (Costs 2 Actions). The lich uses its Paralyzing Touch.\n\nFrightening Gaze (Costs 2 Actions). The lich fixes its gaze on one creature it can see within 10 feet of it. The target must succeed on a DC 18 Wisdom saving throw against this magic or become frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to the lich's gaze for the next 24 hours.\n\nDisrupt Life (Costs 3 Actions). Each living creature within 20 feet of the lich must make a DC 18 Constitution saving throw against this magic, taking 21 (6d6) necrotic damage on a failed save, or half as much damage on a successful one."
      }
    },
    {
      "id": "planetar",
      "name": "Planetar",
      "img": "icons/creatures/celestials/planetar.webp",
      "description": "Planetars are angels who act as the weapons of the gods they serve, protecting the faithful and helping them in their darkest times.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "celestial",
        "alignment": "lawful good",
        "armor_class": "19 (natural armor)",
        "hp_formula": "200 (16d10 + 112)",
        "speed": "40 ft., fly 120 ft.",
        "strength": 24,
        "dexterity": 20,
        "constitution": 24,
        "intelligence": 19,
        "wisdom": 22,
        "charisma": 25,
        "saving_throws": "Con +12, Wis +11, Cha +12",
        "skills": "Perception +11",
        "damage_resistances": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, exhaustion, frightened",
        "senses": "truesight 120 ft., passive Perception 21",
        "languages": "all, telepathy 120 ft.",
        "challenge_rating": "16",
        "experience_points": 15000,
        "traits": "Angelic Weapons. The planetar's weapon attacks are magical. When the planetar hits with any weapon, the weapon deals an extra 5d8 radiant damage (included in the attack).\n\nDivine Awareness. The planetar knows if it hears a lie.\n\nInnate Spellcasting. The planetar's spellcasting ability is Charisma (spell save DC 20). The planetar can innately cast the following spells, requiring no material components:\n\nAt will: detect evil and good, invisibility (self only)\n3/day each: blade barrier, dispel evil and good, flame strike, raise dead\n1/day each: commune, control weather, insect plague\n\nMagic Resistance. The planetar has advantage on saving throws against spells and other magical effects.",
        "actions": "Multiattack. The planetar makes two melee attacks.\n\nGreatsword. Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 21 (4d6 + 7) slashing damage plus 22 (5d8) radiant damage.\n\nHealing Touch (4/Day). The planetar touches another creature. The target magically regains 30 (6d8 + 3) hit points and is freed from any curse, disease, poison, blindness, or deafness."
      }
    },
    {
      "id": "solar",
      "name": "Solar",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/solar-time.svg",
      "description": "A solar is a godlike being, a paragon of celestial virtue and might. No task is beyond its abilities, and the solar acts with supreme confidence.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "celestial",
        "alignment": "lawful good",
        "armor_class": "21 (natural armor)",
        "hp_formula": "243 (18d10 + 144)",
        "speed": "50 ft., fly 150 ft.",
        "strength": 26,
        "dexterity": 22,
        "constitution": 26,
        "intelligence": 25,
        "wisdom": 25,
        "charisma": 30,
        "saving_throws": "Int +14, Wis +14, Cha +17",
        "skills": "Perception +14",
        "damage_resistances": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "necrotic, poison",
        "condition_immunities": "charmed, exhaustion, frightened, poisoned",
        "senses": "truesight 120 ft., passive Perception 24",
        "languages": "all, telepathy 120 ft.",
        "challenge_rating": "21",
        "experience_points": 33000,
        "traits": "Angelic Weapons. The solar's weapon attacks are magical. When the solar hits with any weapon, the weapon deals an extra 6d8 radiant damage (included in the attack).\n\nDivine Awareness. The solar knows if it hears a lie.\n\nInnate Spellcasting. The solar's spellcasting ability is Charisma (spell save DC 25). It can innately cast the following spells, requiring no material components:\n\nAt will: detect evil and good, invisibility (self only)\n3/day each: blade barrier, dispel evil and good, resurrection\n1/day each: commune, control weather\n\nLegendary Resistance (3/Day). If the solar fails a saving throw, it can choose to succeed instead.\n\nMagic Resistance. The solar has advantage on saving throws against spells and other magical effects.",
        "actions": "Multiattack. The solar makes two greatsword attacks.\n\nGreatsword. Melee Weapon Attack: +15 to hit, reach 5 ft., one target. Hit: 22 (4d6 + 8) slashing damage plus 27 (6d8) radiant damage.\n\nSlaying Longbow. Ranged Weapon Attack: +13 to hit, range 150/600 ft., one target. Hit: 15 (2d8 + 6) piercing damage plus 27 (6d8) radiant damage. If the target is a creature that has 100 hit points or fewer, it must succeed on a DC 15 Constitution saving throw or die.\n\nFlying Sword. The solar releases its greatsword to hover magically in an unoccupied space within 5 feet of it. If the solar can see the sword, the solar can mentally command it as a bonus action to fly up to 50 feet and either make one attack against a target or return to the solar's hands. If the hovering sword is targeted by any effect, the solar is considered to be holding it. The hovering sword falls if the solar dies.\n\nHealing Touch (4/Day). The solar touches another creature. The target magically regains 40 (8d8 + 4) hit points and is freed from any curse, disease, poison, blindness, or deafness.",
        "legendary_actions": "The solar can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The solar regains spent legendary actions at the start of its turn.\n\nTeleport. The solar magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see.\n\nSearing Burst (Costs 2 Actions). The solar emits magical, divine energy. Each creature of its choice in a 10-foot radius must make a DC 23 Dexterity saving throw, taking 14 (4d6) fire damage plus 14 (4d6) radiant damage on a failed save, or half as much damage on a successful one.\n\nBlinding Gaze (Costs 3 Actions). The solar targets one creature it can see within 30 feet of it. If the target can see it, the target must succeed on a DC 15 Constitution saving throw or be blinded until magic such as the lesser restoration spell removes the blindness."
      }
    },
    {
      "id": "ancient-red-dragon",
      "name": "Ancient Red Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most covetous of the true dragons, red dragons tirelessly seek to increase their treasure hoards. Ancient red dragons are among the most powerful creatures in existence.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "dragon",
        "alignment": "chaotic evil",
        "armor_class": "22 (natural armor)",
        "hp_formula": "546 (28d20 + 252)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "strength": 30,
        "dexterity": 10,
        "constitution": 29,
        "intelligence": 18,
        "wisdom": 15,
        "charisma": 23,
        "saving_throws": "Dex +7, Con +16, Wis +9, Cha +13",
        "skills": "Perception +16, Stealth +7",
        "damage_immunities": "fire",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 26",
        "languages": "Common, Draconic",
        "challenge_rating": "24",
        "experience_points": 62000,
        "traits": "Legendary Resistance (3/Day). If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "Multiattack. The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\nBite. Melee Weapon Attack: +17 to hit, reach 15 ft., one target. Hit: 21 (2d10 + 10) piercing damage plus 14 (4d6) fire damage.\n\nClaw. Melee Weapon Attack: +17 to hit, reach 10 ft., one target. Hit: 17 (2d6 + 10) slashing damage.\n\nTail. Melee Weapon Attack: +17 to hit, reach 20 ft., one target. Hit: 19 (2d8 + 10) bludgeoning damage.\n\nFrightful Presence. Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 21 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\nFire Breath (Recharge 5–6). The dragon exhales fire in a 90-foot cone. Each creature in that area must make a DC 24 Dexterity saving throw, taking 91 (26d6) fire damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 25 Dexterity saving throw or take 17 (2d6 + 10) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."
      }
    },
    {
      "id": "tarrasque",
      "name": "Tarrasque",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/tie.svg",
      "description": "The legendary tarrasque is possibly the most dreaded monster of the Material Plane. It is widely believed that only one of these creatures exists, though no one can predict where and when it will strike.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "monstrosity (titan)",
        "alignment": "unaligned",
        "armor_class": "25 (natural armor)",
        "hp_formula": "676 (33d20 + 330)",
        "speed": "40 ft.",
        "strength": 30,
        "dexterity": 11,
        "constitution": 30,
        "intelligence": 3,
        "wisdom": 11,
        "charisma": 11,
        "saving_throws": "Int +5, Wis +9, Cha +9",
        "damage_immunities": "fire, poison; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, frightened, paralyzed, poisoned",
        "senses": "blindsight 120 ft., passive Perception 10",
        "languages": "—",
        "challenge_rating": "30",
        "experience_points": 155000,
        "traits": "Legendary Resistance (3/Day). If the tarrasque fails a saving throw, it can choose to succeed instead.\n\nMagic Resistance. The tarrasque has advantage on saving throws against spells and other magical effects.\n\nReflective Carapace. Any time the tarrasque is targeted by a magic missile spell, a line spell, or a spell that requires a ranged attack roll, roll a d6. On a 1 to 5, the tarrasque is unaffected. On a 6, the tarrasque is unaffected, and the effect is reflected back at the caster as though it originated from the tarrasque, turning the caster into the target.\n\nSiege Monster. The tarrasque deals double damage to objects and structures.",
        "actions": "Multiattack. The tarrasque can use its Frightful Presence. It then makes five attacks: one with its bite, two with its claws, one with its horns, and one with its tail. It can use its Swallow instead of its bite.\n\nBite. Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 36 (4d12 + 10) piercing damage. If the target is a creature, it is grappled (escape DC 20). Until this grapple ends, the target is restrained, and the tarrasque can't bite another target.\n\nClaw. Melee Weapon Attack: +19 to hit, reach 15 ft., one target. Hit: 28 (4d8 + 10) slashing damage.\n\nHorns. Melee Weapon Attack: +19 to hit, reach 10 ft., one target. Hit: 32 (4d10 + 10) piercing damage.\n\nTail. Melee Weapon Attack: +19 to hit, reach 20 ft., one target. Hit: 24 (4d6 + 10) bludgeoning damage. If the target is a creature, it must succeed on a DC 20 Strength saving throw or be knocked prone.\n\nFrightful Presence. Each creature of the tarrasque's choice within 120 feet of it and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, with disadvantage if the tarrasque is within line of sight, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the tarrasque's Frightful Presence for the next 24 hours.\n\nSwallow. The tarrasque makes one bite attack against a Large or smaller creature it is grappling. If the attack hits, the target takes the bite's damage, the target is swallowed, and the grapple ends. While swallowed, the creature is blinded and restrained, it has total cover against attacks and other effects outside the tarrasque, and it takes 56 (16d6) acid damage at the start of each of the tarrasque's turns. If the tarrasque takes 60 damage or more on a single turn from a creature inside it, the tarrasque must succeed on a DC 20 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the tarrasque. If the tarrasque dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 30 feet of movement, exiting prone.",
        "legendary_actions": "The tarrasque can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The tarrasque regains spent legendary actions at the start of its turn.\n\nAttack. The tarrasque makes one claw attack or tail attack.\n\nMove. The tarrasque moves up to half its speed.\n\nChomp (Costs 2 Actions). The tarrasque makes one bite attack or uses its Swallow."
      }
    }
  ]
}