{
  "compendiumId": "dnd5e-srd-monsters-cr-14-16",
  "name": "CR 14-16 Monsters",
  "templateId": "dnd5e-monster",
  "source": "SRD 5.1",
  "entries": [
    {
      "id": "adult-black-dragon",
      "name": "Adult Black Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A vicious chromatic dragon that dwells in swamps and marshes, delighting in cruelty.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "ce",
        "armor_class": "19 (natural armor)",
        "hp_formula": "195 (17d12 + 85)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 23,
        "dexterity": 14,
        "constitution": 21,
        "intelligence": 14,
        "wisdom": 13,
        "charisma": 17,
        "saving_throws": "Dex +7, Con +10, Wis +6, Cha +8",
        "skills": "Perception +11, Stealth +7",
        "damage_immunities": "acid",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21",
        "languages": "Common, Draconic",
        "challenge_rating": "14",
        "experience_points": 11500,
        "proficiency_bonus": 5,
        "traits": "**Amphibious.** The dragon can breathe air and water.\n\n**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 4 (1d8) acid damage.\n\n**Claw.** Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\n**Tail.** Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Acid Breath (Recharge 5-6).** The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n• Pools of water that the dragon can see within 120 feet of it surge outward in a grasping tide. Any creature on the ground within 20 feet of such a pool must succeed on a DC 15 Strength saving throw or be pulled up to 20 feet into the water and knocked prone.\n\n• A cloud of swarming insects fills a 20-foot-radius sphere centered on a point the dragon chooses within 120 feet of it. The cloud spreads around corners and remains until the dragon disperses it as an action, uses this lair action again, or dies. The cloud is lightly obscured. Any creature in the cloud when it appears must make on a DC 15 Constitution saving throw, taking 10 (3d6) piercing damage on a failed save, or half as much damage on a successful one. A creature that ends its turn in the cloud takes 10 (3d6) piercing damage.\n\n• Magical darkness spreads from a point the dragon chooses within 60 feet of it, filling a 15-foot-radius sphere until the dragon dismisses it as an action, uses this lair action again, or dies. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it. If any of the effect's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
        "regional_effects": "The region containing a legendary black dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n• The land within 6 miles of the lair takes twice as long as normal to traverse, since the plants grow thick and twisted, and the swamps are thick with reeking mud.\n\n• Water sources within 1 mile of the lair are supernaturally fouled. Enemies of the dragon that drink such water regurgitate it within minutes.\n\n• Fog lightly obscures the land within 6 miles of the lair.\n\nIf the dragon dies, vegetation remains as it has grown, but other effects fade over 1d10 days."
      }
    },
    {
      "id": "adult-copper-dragon",
      "name": "Adult Copper Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A playful metallic dragon with a love of jokes and riddles, dwelling in rocky hills.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "cg",
        "armor_class": "18 (natural armor)",
        "hp_formula": "184 (16d12 + 80)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "strength": 23,
        "dexterity": 12,
        "constitution": 21,
        "intelligence": 18,
        "wisdom": 15,
        "charisma": 17,
        "saving_throws": "Dex +6, Con +10, Wis +7, Cha +8",
        "skills": "Deception +8, Perception +12, Stealth +6",
        "damage_immunities": "acid",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "14",
        "experience_points": 11500,
        "proficiency_bonus": 5,
        "traits": "**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.\n\n**Claw.** Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\n**Tail.** Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Breath Weapons (Recharge 5-6).** The dragon uses one of the following breath weapons:\n\n**Acid Breath.** The dragon exhales acid in an 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.\n\n**Slowing Breath.** The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 Constitution saving throw. On a failed save, the creature can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "death-tyrant",
      "name": "Death Tyrant",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/crystal-ball.svg",
      "description": "An undead beholder that has embraced lichdom, seeking to conquer death itself.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "undead",
        "alignment": "le",
        "armor_class": "19 (natural armor)",
        "hp_formula": "187 (25d10 + 50)",
        "speed": "0 ft., fly 20 ft. (hover)",
        "strength": 10,
        "dexterity": 14,
        "constitution": 14,
        "intelligence": 19,
        "wisdom": 15,
        "charisma": 19,
        "saving_throws": "Str +5, Con +7, Int +9, Wis +7, Cha +9",
        "skills": "Perception +12",
        "damage_immunities": "poison",
        "condition_immunities": "charmed, exhaustion, paralyzed, petrified, poisoned, prone",
        "senses": "darkvision 120 ft., passive Perception 22",
        "languages": "Deep Speech, Undercommon",
        "challenge_rating": "14",
        "experience_points": 11500,
        "proficiency_bonus": 5,
        "traits": "**Negative Energy Cone.** The death tyrant's central eye emits an invisible, magical 150-foot cone of negative energy. At the start of each of its turns, the death tyrant decides which way the cone faces and whether the cone is active. Any creature in that area can't regain hit points. Any humanoid that dies there becomes a zombie under the death tyrant's command. The dead humanoid retains its place in the initiative order and animates at the start of its next turn, provided that its body hasn't been completely destroyed.",
        "actions": "**Bite.** Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (4d6) piercing damage.\n\n**Eye Rays.** The death tyrant shoots three of the following magical eye rays at random (reroll duplicates), choosing one to three targets it can see within 120 feet of it:\n\n**1. Charm Ray.** The targeted creature must succeed on a DC 17 Wisdom saving throw or be charmed by the death tyrant for 1 hour, or until the death tyrant harms the creature.\n\n**2. Paralyzing Ray.** The targeted creature must succeed on a DC 17 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**3. Fear Ray.** The targeted creature must succeed on a DC 17 Wisdom saving throw or be frightened for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**4. Slowing Ray.** The targeted creature must succeed on a DC 17 Dexterity saving throw. On a failed save, the target's speed is halved for 1 minute. In addition, the creature can't take reactions, and it can take either an action or a bonus action on its turn, not both. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**5. Enervation Ray.** The targeted creature must make a DC 17 Constitution saving throw, taking 36 (8d8) necrotic damage on a failed save, or half as much damage on a successful one.\n\n**6. Telekinetic Ray.** If the target is a creature, it must succeed on a DC 17 Strength saving throw or the death tyrant moves it up to 30 feet in any direction. It is restrained by the ray's telekinetic grip until the start of the death tyrant's next turn or until the death tyrant is incapacitated. If the target is an object weighing 300 pounds or less that isn't being worn or carried, it is moved up to 30 feet in any direction. The death tyrant can also exert fine control on objects with this ray, such as manipulating a simple tool or opening a door or a container.\n\n**7. Sleep Ray.** The targeted creature must succeed on a DC 17 Wisdom saving throw or fall asleep and remain unconscious for 1 minute. The target awakens if it takes damage or another creature takes an action to wake it. This ray has no effect on constructs and undead.\n\n**8. Petrification Ray.** The targeted creature must make a DC 17 Dexterity saving throw. On a failed save, the creature begins to turn to stone and is restrained. It must repeat the saving throw at the end of its next turn. On a success, the effect ends. On a failure, the creature is petrified until freed by the greater restoration spell or other magic.\n\n**9. Disintegration Ray.** If the target is a creature, it must succeed on a DC 17 Dexterity saving throw or take 45 (10d8) force damage. If this damage reduces the creature to 0 hit points, its body becomes a pile of fine gray dust. If the target is a Large or smaller nonmagical object or creation of magical force, it is disintegrated without a saving throw. If the target is a Huge or larger object or creation of magical force, this ray disintegrates a 10-foot cube of it.\n\n**10. Death Ray.** The targeted creature must succeed on a DC 17 Dexterity saving throw or take 55 (10d10) necrotic damage. The target dies if the ray reduces it to 0 hit points.",
        "legendary_actions": "The death tyrant can take 3 legendary actions, using the Eye Ray option below. It can take only one legendary action at a time and only at the end of another creature's turn. The death tyrant regains spent legendary actions at the start of its turn.\n\n**Eye Ray.** The death tyrant uses one random eye ray.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "ice-devil",
      "name": "Ice Devil",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/horned-helm.svg",
      "description": "A cunning devil covered in icy spines, wielding a deadly spear and commanding cold.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "fiend (devil)",
        "alignment": "le",
        "armor_class": "18 (natural armor)",
        "hp_formula": "180 (19d10 + 76)",
        "speed": "40 ft.",
        "strength": 21,
        "dexterity": 14,
        "constitution": 18,
        "intelligence": 18,
        "wisdom": 15,
        "charisma": 18,
        "saving_throws": "Dex +7, Con +8, Wis +6, Cha +8",
        "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks that aren't silvered",
        "damage_immunities": "fire, poison",
        "condition_immunities": "poisoned",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 12",
        "languages": "Infernal, telepathy 120 ft.",
        "challenge_rating": "14",
        "experience_points": 11500,
        "proficiency_bonus": 5,
        "traits": "**Devil's Sight.** Magical darkness doesn't impede the devil's darkvision.\n\n**Magic Resistance.** The devil has advantage on saving throws against spells and other magical effects.",
        "actions": "**Multiattack.** The devil makes three attacks: one with its bite, one with its claws, and one with its tail.\n\n**Bite.** Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) piercing damage plus 10 (3d6) cold damage.\n\n**Claws.** Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 10 (2d4 + 5) slashing damage plus 10 (3d6) cold damage.\n\n**Tail.** Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage plus 10 (3d6) cold damage.\n\n**Wall of Ice (Recharge 6).** The devil magically forms an opaque wall of ice on a solid surface it can see within 60 feet of it. The wall is 1 foot thick and up to 30 feet long and 10 feet high, or it's a hemispherical dome up to 20 feet in diameter. When the wall appears, each creature in its space is pushed out of it by the shortest route. The creature chooses which side of the wall to end up on, unless the creature is incapacitated. The creature then makes a DC 17 Dexterity saving throw, taking 35 (10d6) cold damage on a failed save, or half as much damage on a successful one. The wall lasts for 1 minute or until the devil is incapacitated or dies. The wall can be damaged and breached; each 10-foot section has AC 5, 30 hit points, vulnerability to fire damage, and immunity to acid, cold, necrotic, poison, and psychic damage. If a section is destroyed, it leaves behind a sheet of frigid air in the space the wall occupied. Whenever a creature finishes moving through the frigid air on a turn, willingly or otherwise, the creature must make a DC 17 Constitution saving throw, taking 17 (5d6) cold damage on a failed save, or half as much damage on a successful one. The frigid air dissipates when the rest of the wall vanishes."
      }
    },
    {
      "id": "adult-bronze-dragon",
      "name": "Adult Bronze Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A noble metallic dragon that dwells near coastlines, protector of the innocent.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "lg",
        "armor_class": "19 (natural armor)",
        "hp_formula": "212 (17d12 + 102)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 25,
        "dexterity": 10,
        "constitution": 23,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 19,
        "saving_throws": "Dex +5, Con +11, Wis +7, Cha +9",
        "skills": "Insight +7, Perception +12, Stealth +5",
        "damage_immunities": "lightning",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "15",
        "experience_points": 13000,
        "proficiency_bonus": 5,
        "traits": "**Amphibious.** The dragon can breathe air and water.\n\n**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage.\n\n**Claw.** Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.\n\n**Tail.** Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Breath Weapons (Recharge 5-6).** The dragon uses one of the following breath weapons:\n\n**Lightning Breath.** The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.\n\n**Repulsion Breath.** The dragon exhales repulsion energy in a 30-foot cone. Each creature in that area must succeed on a DC 19 Strength saving throw. On a failed save, the creature is pushed 60 feet away from the dragon.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "adult-green-dragon",
      "name": "Adult Green Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A scheming chromatic dragon that dwells in ancient forests, master of manipulation and deceit.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "le",
        "armor_class": "19 (natural armor)",
        "hp_formula": "207 (18d12 + 90)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 23,
        "dexterity": 12,
        "constitution": 21,
        "intelligence": 18,
        "wisdom": 15,
        "charisma": 17,
        "saving_throws": "Dex +6, Con +10, Wis +7, Cha +8",
        "skills": "Deception +8, Insight +7, Perception +12, Persuasion +8, Stealth +6",
        "damage_immunities": "poison",
        "condition_immunities": "poisoned",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "15",
        "experience_points": 13000,
        "proficiency_bonus": 5,
        "traits": "**Amphibious.** The dragon can breathe air and water.\n\n**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 7 (2d6) poison damage.\n\n**Claw.** Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.\n\n**Tail.** Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Poison Breath (Recharge 5-6).** The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 56 (16d6) poison damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n• Grasping roots and vines erupt in a 20-foot radius centered on a point on the ground that the dragon can see within 120 feet of it. That area becomes difficult terrain, and each creature there must succeed on a DC 15 Strength saving throw or be restrained by the roots and vines. A creature can be freed if it or another creature takes an action to make a DC 15 Strength check and succeeds. The roots and vines wilt away when the dragon uses this lair action again or when the dragon dies.\n\n• A wall of tangled brush bristling with thorns springs into existence on a solid surface within 120 feet of the dragon. The wall is up to 60 feet long, 10 feet high, and 5 feet thick, and it blocks line of sight. When the wall appears, each creature in its area must make a DC 15 Dexterity saving throw. A creature that fails the save takes 18 (4d8) piercing damage and is pushed 5 feet out of the wall's space, appearing on whichever side of the wall it wants. A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature travels through the wall, it must spend 4 feet of movement. Furthermore, a creature in the wall's space must make a DC 15 Dexterity saving throw once each round it's in contact with the wall, taking 18 (4d8) piercing damage on a failed save, or half as much damage on a successful one. Each 10-foot section of wall has AC 5, 15 hit points, vulnerability to fire damage, resistance to bludgeoning and piercing damage, and immunity to psychic damage. The wall sinks back into the ground when the dragon uses this lair action again or when the dragon dies.\n\n• Magical fog billows around one creature the dragon can see within 120 feet of it. The creature must succeed on a DC 15 Wisdom saving throw or be charmed by the dragon until initiative count 20 on the next round.",
        "regional_effects": "The region containing a legendary green dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n• Thickets form labyrinthine patterns within 1 mile of the dragon's lair. The thickets act as 10-foot-high, 10-foot-thick walls that block line of sight. Creatures can move through the thickets, with every 1 foot a creature moves costing it 4 feet of movement. A creature in the thickets must make a DC 15 Dexterity saving throw once each round it's in contact with the thickets or take 3 (1d6) piercing damage from thorns.\n\nEach 10-foot-cube of thickets has AC 5, 30 hit points, resistance to bludgeoning and piercing damage, vulnerability to fire damage, and immunity to psychic and thunder damage.\n\n• Within 1 mile of its lair, the dragon leaves no physical evidence of its passage unless it wishes to. Tracking it there is impossible except by magical means. In addition, it ignores movement impediments and damage from plants in this area that are neither magical nor creatures, including the thickets described above. The plants remove themselves from the dragon's path.\n\n• Rodents and birds within 1 mile of the dragon's lair serve as the dragon's eyes and ears. Deer and other large game are strangely absent, hinting at the presence of an unnaturally hungry predator.\n\nIf the dragon dies, the rodents and birds lose their supernatural link to it. The thickets remain, but within 1d10 days, they become mundane plants and normal difficult terrain, losing their thorns."
      }
    },
    {
      "id": "mummy-lord",
      "name": "Mummy Lord",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/king.svg",
      "description": "An ancient undead ruler wrapped in funeral shrouds, retaining their arcane power and commanding presence.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "medium",
        "type": "undead",
        "alignment": "le",
        "armor_class": "17 (natural armor)",
        "hp_formula": "97 (13d8 + 39)",
        "speed": "20 ft.",
        "strength": 18,
        "dexterity": 10,
        "constitution": 17,
        "intelligence": 11,
        "wisdom": 18,
        "charisma": 16,
        "saving_throws": "Con +8, Int +5, Wis +9, Cha +8",
        "skills": "History +5, Religion +5",
        "damage_vulnerabilities": "fire",
        "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "necrotic, poison",
        "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned",
        "senses": "darkvision 60 ft., passive Perception 14",
        "languages": "the languages it knew in life",
        "challenge_rating": "15",
        "experience_points": 13000,
        "proficiency_bonus": 5,
        "traits": "**Magic Resistance.** The mummy lord has advantage on saving throws against spells and other magical effects.\n\n**Rejuvenation.** A destroyed mummy lord gains a new body in 24 hours if its heart is intact, regaining all its hit points and becoming active again. The new body appears within 5 feet of the mummy lord's heart.\n\n**Spellcasting.** The mummy lord is a 10th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 17, +9 to hit with spell attacks). The mummy lord has the following cleric spells prepared:\n\nCantrips (at will): sacred flame, thaumaturgy\n1st level (4 slots): command, guiding bolt, shield of faith\n2nd level (3 slots): hold person, silence, spiritual weapon\n3rd level (3 slots): animate dead, dispel magic\n4th level (3 slots): divination, guardian of faith\n5th level (2 slots): contagion, insect plague\n6th level (1 slot): harm",
        "actions": "**Multiattack.** The mummy lord can use its Dreadful Glare and makes one attack with its rotting fist.\n\n**Rotting Fist.** Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 14 (3d6 + 4) bludgeoning damage plus 21 (6d6) necrotic damage. If the target is a creature, it must succeed on a DC 16 Constitution saving throw or be cursed with mummy rot. The cursed target can't regain hit points, and its hit point maximum decreases by 10 (3d6) for every 24 hours that elapse. If the curse reduces the target's hit point maximum to 0, the target dies, and its body turns to dust. The curse lasts until removed by the remove curse spell or other magic.\n\n**Dreadful Glare.** The mummy lord targets one creature it can see within 60 feet of it. If the target can see the mummy lord, it must succeed on a DC 16 Wisdom saving throw against this magic or become frightened until the end of the mummy's next turn. If the target fails the saving throw by 5 or more, it is also paralyzed for the same duration. A target that succeeds on the saving throw is immune to the Dreadful Glare of all mummies and mummy lords for the next 24 hours.",
        "legendary_actions": "The mummy lord can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The mummy lord regains spent legendary actions at the start of its turn.\n\n**Attack.** The mummy lord makes one attack with its rotting fist or uses its Dreadful Glare.\n\n**Blinding Dust.** Blinding dust and sand swirls magically around the mummy lord. Each creature within 5 feet of the mummy lord must succeed on a DC 16 Constitution saving throw or be blinded until the end of the creature's next turn.\n\n**Blasphemous Word (Costs 2 Actions).** The mummy lord utters a blasphemous word. Each non-undead creature within 10 feet of the mummy lord that can hear the magical utterance must succeed on a DC 16 Constitution saving throw or be stunned until the end of the mummy lord's next turn.\n\n**Channel Negative Energy (Costs 2 Actions).** The mummy lord magically unleashes negative energy. Creatures within 60 feet of the mummy lord, including ones behind barriers and around corners, can't regain hit points until the end of the mummy lord's next turn.\n\n**Whirlwind of Sand (Costs 2 Actions).** The mummy lord magically transforms into a whirlwind of sand, moves up to 60 feet, and reverts to its normal form. While in whirlwind form, the mummy lord is immune to all damage, and it can't be grappled, petrified, knocked prone, restrained, or stunned. Equipment worn or carried by the mummy lord remain in its possession.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the mummy lord takes a lair action to cause one of the following effects; the mummy lord can't use the same effect two rounds in a row:\n\n• Each undead creature in the lair can pinpoint the location of each living creature within 120 feet of it until initiative count 20 on the next round.\n\n• Each undead in the lair has advantage on saving throws against effects that turn undead until initiative count 20 on the next round.\n\n• Until initiative count 20 on the next round, any non-undead creature that tries to cast a spell of 4th level or lower in the mummy lord's lair is wracked with pain. The creature can choose another action, but if it tries to cast the spell, it must make a DC 16 Constitution saving throw. On a failed save, it takes 1d6 necrotic damage per level of the spell, and the spell has no effect and is wasted.",
        "regional_effects": "A mummy lord's temple or tomb is warped in any of the following ways by the creature's dark presence:\n\n• Food instantly molders and water instantly evaporates when brought into the lair. Other nonmagical drinks are spoiled—wine turning to vinegar, for instance.\n\n• Divination spells cast within the lair by creatures other than the mummy lord have a 25 percent chance to provide misleading results, as determined by the DM. If a divination spell already has a chance to fail or become unreliable when cast multiple times, that chance increases by 25 percent.\n\n• A creature that takes treasure from the lair is cursed until the treasure is returned. The cursed target has disadvantage on all saving throws. The curse lasts until removed by a remove curse spell or other magic.\n\nIf the mummy lord is destroyed, these regional effects end immediately."
      }
    },
    {
      "id": "purple-worm",
      "name": "Purple Worm",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/rat.svg",
      "description": "A colossal burrowing monstrosity that terrorizes the Underdark, capable of swallowing prey whole.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "monstrosity",
        "alignment": "unaligned",
        "armor_class": "18 (natural armor)",
        "hp_formula": "247 (15d20 + 90)",
        "speed": "50 ft., burrow 30 ft.",
        "strength": 28,
        "dexterity": 7,
        "constitution": 22,
        "intelligence": 1,
        "wisdom": 8,
        "charisma": 4,
        "saving_throws": "Con +11, Wis +4",
        "senses": "blindsight 30 ft., tremorsense 60 ft., passive Perception 9",
        "languages": "—",
        "challenge_rating": "15",
        "experience_points": 13000,
        "proficiency_bonus": 5,
        "traits": "**Tunneler.** The worm can burrow through solid rock at half its burrow speed and leaves a 10-foot-diameter tunnel in its wake.",
        "actions": "**Multiattack.** The worm makes two attacks: one with its bite and one with its stinger.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 22 (3d8 + 9) piercing damage. If the target is a Large or smaller creature, it must succeed on a DC 19 Dexterity saving throw or be swallowed by the worm. A swallowed creature is blinded and restrained, it has total cover against attacks and other effects outside the worm, and it takes 21 (6d6) acid damage at the start of each of the worm's turns. If the worm takes 30 damage or more on a single turn from a creature inside it, the worm must succeed on a DC 21 Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall prone in a space within 10 feet of the worm. If the worm dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 20 feet of movement, exiting prone.\n\n**Tail Stinger.** Melee Weapon Attack: +14 to hit, reach 10 ft., one creature. Hit: 19 (3d6 + 9) piercing damage, and the target must make a DC 19 Constitution saving throw, taking 42 (12d6) poison damage on a failed save, or half as much damage on a successful one."
      }
    },
    {
      "id": "adult-blue-dragon",
      "name": "Adult Blue Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A vain chromatic dragon that dwells in deserts, wielding devastating lightning.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "le",
        "armor_class": "19 (natural armor)",
        "hp_formula": "225 (18d12 + 108)",
        "speed": "40 ft., burrow 30 ft., fly 80 ft.",
        "strength": 25,
        "dexterity": 10,
        "constitution": 23,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 19,
        "saving_throws": "Dex +5, Con +11, Wis +7, Cha +9",
        "skills": "Perception +12, Stealth +5",
        "damage_immunities": "lightning",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22",
        "languages": "Common, Draconic",
        "challenge_rating": "16",
        "experience_points": 15000,
        "proficiency_bonus": 5,
        "traits": "**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 5 (1d10) lightning damage.\n\n**Claw.** Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.\n\n**Tail.** Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Lightning Breath (Recharge 5-6).** The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n• Part of the ceiling collapses above one creature that the dragon can see within 120 feet of it. The creature must succeed on a DC 15 Dexterity saving throw or take 10 (3d6) bludgeoning damage and be knocked prone and buried. The buried target is restrained and unable to breathe or stand up. A creature can take an action to make a DC 10 Strength check, ending the buried state on a success.\n\n• A cloud of sand swirls about in a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The cloud spreads around corners. Each creature in it must succeed on a DC 15 Constitution saving throw or be blinded for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n• Lightning arcs, forming a 5-foot-wide line between two of the lair's solid surfaces that the dragon can see. They must be within 120 feet of the dragon and 120 feet of each other. Each creature in that line must succeed on a DC 15 Dexterity saving throw or take 10 (3d6) lightning damage.",
        "regional_effects": "The region containing a legendary blue dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n• Thunderstorms rage within 6 miles of the lair.\n\n• Dust devils scour the land within 6 miles of the lair. A dust devil has the statistics of an air elemental, but it can't fly, has a speed of 50 feet, and has an Intelligence and Charisma of 1 (−5).\n\n• Hidden sinkholes form in and around the dragon's lair. A sinkhole can be spotted from a safe distance with a successful DC 20 Wisdom (Perception) check. Otherwise, the first creature to step on the thin crust covering the sinkhole must succeed on a DC 15 Dexterity saving throw or fall 1d6 × 10 feet into the sinkhole.\n\nIf the dragon dies, the dust devils disappear immediately, and the thunderstorms abate within 1d10 days. Any sinkholes remain where they are."
      }
    },
    {
      "id": "adult-silver-dragon",
      "name": "Adult Silver Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "A noble metallic dragon that champions good causes and protects the innocent.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "lg",
        "armor_class": "19 (natural armor)",
        "hp_formula": "243 (18d12 + 126)",
        "speed": "40 ft., fly 80 ft.",
        "strength": 27,
        "dexterity": 10,
        "constitution": 25,
        "intelligence": 16,
        "wisdom": 13,
        "charisma": 21,
        "saving_throws": "Dex +5, Con +12, Wis +6, Cha +10",
        "skills": "Arcana +8, History +8, Perception +11, Stealth +5",
        "damage_immunities": "cold",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21",
        "languages": "Common, Draconic",
        "challenge_rating": "16",
        "experience_points": 15000,
        "proficiency_bonus": 5,
        "traits": "**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.\n\n**Claw.** Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\n**Tail.** Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Breath Weapons (Recharge 5-6).** The dragon uses one of the following breath weapons:\n\n**Cold Breath.** The dragon exhales an icy blast in a 60-foot cone. Each creature in that area must make a DC 20 Constitution saving throw, taking 58 (13d8) cold damage on a failed save, or half as much damage on a successful one.\n\n**Paralyzing Breath.** The dragon exhales paralyzing gas in a 60-foot cone. Each creature in that area must succeed on a DC 20 Constitution saving throw or be paralyzed for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**Change Shape.** The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice). In a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 21 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "iron-golem",
      "name": "Iron Golem",
      "img": "/game-systems/dnd5e-ogl/assets/icons/delapouite/tie.svg",
      "description": "A massive construct forged from iron, nearly unstoppable and immune to most magic.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "construct",
        "alignment": "unaligned",
        "armor_class": "20 (natural armor)",
        "hp_formula": "210 (20d10 + 100)",
        "speed": "30 ft.",
        "strength": 24,
        "dexterity": 9,
        "constitution": 20,
        "intelligence": 3,
        "wisdom": 11,
        "charisma": 1,
        "damage_immunities": "fire, poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks that aren't adamantine",
        "condition_immunities": "charmed, exhaustion, frightened, paralyzed, petrified, poisoned",
        "senses": "darkvision 120 ft., passive Perception 10",
        "languages": "understands the languages of its creator but can't speak",
        "challenge_rating": "16",
        "experience_points": 15000,
        "proficiency_bonus": 5,
        "traits": "**Fire Absorption.** Whenever the golem is subjected to fire damage, it takes no damage and instead regains a number of hit points equal to the fire damage dealt.\n\n**Immutable Form.** The golem is immune to any spell or effect that would alter its form.\n\n**Magic Resistance.** The golem has advantage on saving throws against spells and other magical effects.\n\n**Magic Weapons.** The golem's weapon attacks are magical.",
        "actions": "**Multiattack.** The golem makes two melee attacks.\n\n**Slam.** Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 20 (3d8 + 7) bludgeoning damage.\n\n**Sword.** Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 23 (3d10 + 7) slashing damage.\n\n**Poison Breath (Recharge 6).** The golem exhales poisonous gas in a 15-foot cone. Each creature in that area must make a DC 19 Constitution saving throw, taking 45 (10d8) poison damage on a failed save, or half as much damage on a successful one."
      }
    },
    {
      "id": "marilith",
      "name": "Marilith",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/snake.svg",
      "description": "A powerful demon with six arms and a serpentine lower body, a tactical genius of the Abyss.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "fiend (demon)",
        "alignment": "ce",
        "armor_class": "18 (natural armor)",
        "hp_formula": "189 (18d10 + 90)",
        "speed": "40 ft.",
        "strength": 18,
        "dexterity": 20,
        "constitution": 20,
        "intelligence": 18,
        "wisdom": 16,
        "charisma": 20,
        "saving_throws": "Str +9, Con +10, Wis +8, Cha +10",
        "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "poison",
        "condition_immunities": "poisoned",
        "senses": "truesight 120 ft., passive Perception 13",
        "languages": "Abyssal, telepathy 120 ft.",
        "challenge_rating": "16",
        "experience_points": 15000,
        "proficiency_bonus": 5,
        "traits": "**Magic Resistance.** The marilith has advantage on saving throws against spells and other magical effects.\n\n**Magic Weapons.** The marilith's weapon attacks are magical.\n\n**Reactive.** The marilith can take one reaction on every turn in a combat.",
        "actions": "**Multiattack.** The marilith makes seven attacks: six with its longswords and one with its tail.\n\n**Longsword.** Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.\n\n**Tail.** Melee Weapon Attack: +9 to hit, reach 10 ft., one creature. Hit: 15 (2d10 + 4) bludgeoning damage. If the target is Medium or smaller, it is grappled (escape DC 19). Until this grapple ends, the target is restrained, the marilith can automatically hit the target with its tail, and the marilith can't make tail attacks against other targets.\n\n**Teleport.** The marilith magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see.",
        "reactions": "**Parry.** The marilith adds 5 to its AC against one melee attack that would hit it. To do so, the marilith must see the attacker and be wielding a melee weapon."
      }
    },
    {
      "id": "planetar",
      "name": "Planetar",
      "img": "/game-systems/dnd5e-ogl/assets/icons/cathelineau/holy-oak.svg",
      "description": "A powerful angel that serves as a general in celestial armies, wielding divine magic and a greatsword.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "celestial",
        "alignment": "lg",
        "armor_class": "19 (natural armor)",
        "hp_formula": "200 (16d10 + 112)",
        "speed": "40 ft., fly 120 ft.",
        "strength": 24,
        "dexterity": 20,
        "constitution": 24,
        "intelligence": 19,
        "wisdom": 22,
        "charisma": 25,
        "saving_throws": "Con +12, Wis +11, Cha +12",
        "skills": "Perception +11",
        "damage_resistances": "radiant; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, exhaustion, frightened",
        "senses": "truesight 120 ft., passive Perception 21",
        "languages": "all, telepathy 120 ft.",
        "challenge_rating": "16",
        "experience_points": 15000,
        "proficiency_bonus": 5,
        "traits": "**Angelic Weapons.** The planetar's weapon attacks are magical. When the planetar hits with any weapon, the weapon deals an extra 5d8 radiant damage (included in the attack).\n\n**Divine Awareness.** The planetar knows if it hears a lie.\n\n**Innate Spellcasting.** The planetar's spellcasting ability is Charisma (spell save DC 20). The planetar can innately cast the following spells, requiring no material components:\n\nAt will: detect evil and good, invisibility (self only)\n3/day each: blade barrier, dispel evil and good, flame strike, raise dead\n1/day each: commune, control weather, insect plague\n\n**Magic Resistance.** The planetar has advantage on saving throws against spells and other magical effects.",
        "actions": "**Multiattack.** The planetar makes two melee attacks.\n\n**Greatsword.** Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 21 (4d6 + 7) slashing damage plus 22 (5d8) radiant damage.\n\n**Healing Touch (4/Day).** The planetar touches another creature. The target magically regains 30 (6d8 + 3) hit points and is freed from any curse, disease, poison, blindness, or deafness."
      }
    }
  ]
}