{
  "compendiumId": "dnd5e-srd-monsters-cr-17-20",
  "name": "CR 17-20 Monsters",
  "templateId": "dnd5e-monster",
  "source": "SRD 5.1",
  "entries": [
    {
      "id": "adult-gold-dragon",
      "name": "Adult Gold Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most powerful and noble of metallic dragons, paragons of good and wisdom.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "lg",
        "armor_class": "19 (natural armor)",
        "hp_formula": "256 (19d12 + 133)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "strength": 27,
        "dexterity": 14,
        "constitution": 25,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 24,
        "saving_throws": "Dex +8, Con +13, Wis +8, Cha +13",
        "skills": "Insight +8, Perception +14, Persuasion +13, Stealth +8",
        "damage_immunities": "fire",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 24",
        "languages": "Common, Draconic",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Amphibious.** The dragon can breathe air and water.\n\n**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.\n\n**Claw.** Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\n**Tail.** Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 21 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Breath Weapons (Recharge 5-6).** The dragon uses one of the following breath weapons:\n\n**Fire Breath.** The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 66 (12d10) fire damage on a failed save, or half as much damage on a successful one.\n\n**Weakening Breath.** The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 21 Strength saving throw or have disadvantage on Strength-based attack rolls, Strength checks, and Strength saving throws for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**Change Shape.** The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice). In a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "adult-red-dragon",
      "name": "Adult Red Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "The most powerful and arrogant of chromatic dragons, wielding devastating fire.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "dragon",
        "alignment": "ce",
        "armor_class": "19 (natural armor)",
        "hp_formula": "256 (19d12 + 133)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "strength": 27,
        "dexterity": 10,
        "constitution": 25,
        "intelligence": 16,
        "wisdom": 13,
        "charisma": 21,
        "saving_throws": "Dex +6, Con +13, Wis +7, Cha +11",
        "skills": "Perception +13, Stealth +6",
        "damage_immunities": "fire",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
        "languages": "Common, Draconic",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 7 (2d6) fire damage.\n\n**Claw.** Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\n**Tail.** Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Fire Breath (Recharge 5-6).** The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n• Magma erupts from a point on the ground the dragon can see within 120 feet of it, creating a 20-foot-high, 5-foot-radius geyser. Each creature in the geyser's area must make a DC 15 Dexterity saving throw, taking 21 (6d6) fire damage on a failed save, or half as much damage on a successful one.\n\n• A tremor shakes the lair in a 60-foot radius around the dragon. Each creature other than the dragon on the ground in that area must succeed on a DC 15 Dexterity saving throw or be knocked prone.\n\n• Volcanic gases form a cloud in a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The sphere spreads around corners, and its area is lightly obscured. It lasts until initiative count 20 on the next round. Each creature that starts its turn in the cloud must succeed on a DC 13 Constitution saving throw or be poisoned until the end of its turn. While poisoned in this way, a creature is incapacitated.",
        "regional_effects": "The region containing a legendary red dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n• Small earthquakes are common within 6 miles of the dragon's lair.\n\n• Water sources within 1 mile of the lair are supernaturally warm and tainted by sulfur.\n\n• Rocky fissures within 1 mile of the dragon's lair form portals to the Elemental Plane of Fire, allowing creatures of elemental fire into the world to dwell nearby.\n\nIf the dragon dies, these effects fade over the course of 1d10 days."
      }
    },
    {
      "id": "androsphinx",
      "name": "Androsphinx",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/lion.svg",
      "description": "A sphinx with a male humanoid head, powerful guardian of ancient secrets and sacred places.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "monstrosity",
        "alignment": "lg",
        "armor_class": "17 (natural armor)",
        "hp_formula": "199 (19d10 + 95)",
        "speed": "40 ft., fly 60 ft.",
        "strength": 22,
        "dexterity": 10,
        "constitution": 20,
        "intelligence": 16,
        "wisdom": 18,
        "charisma": 23,
        "saving_throws": "Dex +6, Con +11, Int +9, Wis +10",
        "skills": "Arcana +9, Perception +10, Religion +15",
        "damage_immunities": "psychic; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, frightened",
        "senses": "truesight 120 ft., passive Perception 20",
        "languages": "Common, Sphinx",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Inscrutable.** The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. Wisdom (Insight) checks made to ascertain the sphinx's intentions or sincerity have disadvantage.\n\n**Magic Weapons.** The sphinx's weapon attacks are magical.\n\n**Spellcasting.** The sphinx is a 12th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 18, +10 to hit with spell attacks). It requires no material components to cast its spells. The sphinx has the following cleric spells prepared:\n\nCantrips (at will): sacred flame, spare the dying, thaumaturgy\n1st level (4 slots): command, detect evil and good, detect magic\n2nd level (3 slots): lesser restoration, zone of truth\n3rd level (3 slots): dispel magic, tongues\n4th level (3 slots): banishment, freedom of movement\n5th level (2 slots): flame strike, greater restoration\n6th level (1 slot): heroes' feast",
        "actions": "**Multiattack.** The sphinx makes two claw attacks.\n\n**Claw.** Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 17 (2d10 + 6) slashing damage.\n\n**Roar (3/Day).** The sphinx emits a magical roar. Each time it roars before finishing a long rest, the roar is louder and the effect is different, as detailed below. Each creature within 500 feet of the sphinx and able to hear the roar must make a saving throw.\n\n**First Roar.** Each creature that fails a DC 18 Wisdom saving throw is frightened for 1 minute. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**Second Roar.** Each creature that fails a DC 18 Wisdom saving throw is deafened and frightened for 1 minute. A frightened creature is paralyzed and can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**Third Roar.** Each creature makes a DC 18 Constitution saving throw. On a failed save, a creature takes 44 (8d10) thunder damage and is knocked prone. On a successful save, the creature takes half as much damage and isn't knocked prone.",
        "legendary_actions": "The sphinx can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The sphinx regains spent legendary actions at the start of its turn.\n\n**Claw Attack.** The sphinx makes one claw attack.\n\n**Teleport (Costs 2 Actions).** The sphinx magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see.\n\n**Cast a Spell (Costs 3 Actions).** The sphinx casts a spell from its list of prepared spells, using a spell slot as normal.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the sphinx can take a lair action to cause one of the following magical effects; the sphinx can't use an effect again until it finishes a short or long rest:\n\n• The flow of time is altered such that every creature in the lair must reroll initiative. The sphinx can choose not to reroll.\n\n• The effects of time are altered such that every creature in the lair must succeed on a DC 15 Constitution saving throw or become 1d20 years older or younger (the sphinx's choice), but never any younger than 1 year old. A greater restoration spell can restore a creature's age to normal.\n\n• The flow of time within the lair is altered such that everything within moves up to 10 years forward or backward (sphinx's choice). Only the sphinx is immediately aware of the time change. A wish spell can return the caster and up to seven other creatures designated by the caster to their normal time.\n\n• The sphinx shifts itself and up to seven other creatures it can see within in its lair to another plane of existence. Once outside its lair, the sphinx can't use lair actions, but it can return to its lair as a bonus action on its turn, taking up to seven creatures with it.",
        "regional_effects": "The region containing an androsphinx's lair is warped by its magic, which creates one or more of the following effects:\n\n• Creatures within 1 mile of the lair that have an Intelligence score of 3 or higher feel as if they are being watched.\n\n• When a creature with an Intelligence score of 3 or higher comes within 1 mile of the lair, the sphinx becomes aware of the creature's presence and location.\n\nIf the sphinx dies, these effects end immediately."
      }
    },
    {
      "id": "death-knight",
      "name": "Death Knight",
      "img": "/game-systems/dnd5e-ogl/assets/icons/skoll/skeleton.svg",
      "description": "A fallen paladin condemned to undeath, retaining martial prowess and unholy power.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "medium",
        "type": "undead",
        "alignment": "ce",
        "armor_class": "20 (plate, shield)",
        "hp_formula": "180 (19d8 + 95)",
        "speed": "30 ft.",
        "strength": 20,
        "dexterity": 11,
        "constitution": 20,
        "intelligence": 12,
        "wisdom": 16,
        "charisma": 18,
        "saving_throws": "Dex +6, Wis +9, Cha +10",
        "damage_immunities": "necrotic, poison",
        "condition_immunities": "exhaustion, frightened, poisoned",
        "senses": "darkvision 120 ft., passive Perception 13",
        "languages": "Abyssal, Common",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Magic Resistance.** The death knight has advantage on saving throws against spells and other magical effects.\n\n**Marshal Undead.** Unless the death knight is incapacitated, it and undead creatures of its choice within 60 feet of it have advantage on saving throws against features that turn undead.\n\n**Spellcasting.** The death knight is a 19th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). It has the following paladin spells prepared:\n\n1st level (4 slots): command, compelled duel, searing smite\n2nd level (3 slots): hold person, magic weapon\n3rd level (3 slots): dispel magic, elemental weapon\n4th level (3 slots): banishment, staggering smite\n5th level (2 slots): destructive wave (necrotic)",
        "actions": "**Multiattack.** The death knight makes three longsword attacks.\n\n**Longsword.** Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) slashing damage, or 10 (1d10 + 5) slashing damage if used with two hands, plus 18 (4d8) necrotic damage.\n\n**Hellfire Orb (1/Day).** The death knight hurls a magical ball of fire that explodes at a point it can see within 120 feet of it. Each creature in a 20-foot-radius sphere centered on that point must make a DC 18 Dexterity saving throw. The sphere spreads around corners. A creature takes 35 (10d6) fire damage and 35 (10d6) necrotic damage on a failed save, or half as much damage on a successful one.",
        "reactions": "**Parry.** The death knight adds 6 to its AC against one melee attack that would hit it. To do so, the death knight must see the attacker and be wielding a melee weapon."
      }
    },
    {
      "id": "dragon-turtle",
      "name": "Dragon Turtle",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/turtle.svg",
      "description": "A massive sea creature combining the features of a dragon and a giant turtle.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "dragon",
        "alignment": "n",
        "armor_class": "20 (natural armor)",
        "hp_formula": "341 (22d20 + 110)",
        "speed": "20 ft., swim 40 ft.",
        "strength": 25,
        "dexterity": 10,
        "constitution": 20,
        "intelligence": 10,
        "wisdom": 12,
        "charisma": 12,
        "saving_throws": "Dex +6, Con +11, Wis +7",
        "damage_resistances": "fire",
        "senses": "darkvision 120 ft., passive Perception 11",
        "languages": "Aquan, Draconic",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Amphibious.** The dragon turtle can breathe air and water.",
        "actions": "**Multiattack.** The dragon turtle makes three attacks: one with its bite and two with its claws. It can make one tail attack in place of its two claw attacks.\n\n**Bite.** Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 26 (3d12 + 7) piercing damage.\n\n**Claw.** Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 16 (2d8 + 7) slashing damage.\n\n**Tail.** Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 26 (3d12 + 7) bludgeoning damage. If the target is a creature, it must succeed on a DC 20 Strength saving throw or be pushed up to 10 feet away from the dragon turtle and knocked prone.\n\n**Steam Breath (Recharge 5-6).** The dragon turtle exhales scalding steam in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 52 (15d6) fire damage on a failed save, or half as much damage on a successful one. Being underwater doesn't grant resistance against this damage."
      }
    },
    {
      "id": "goristro",
      "name": "Goristro",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/minotaur.svg",
      "description": "A colossal demon resembling a minotaur, a siege engine of destruction.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "fiend (demon)",
        "alignment": "ce",
        "armor_class": "19 (natural armor)",
        "hp_formula": "310 (23d12 + 161)",
        "speed": "40 ft.",
        "strength": 25,
        "dexterity": 11,
        "constitution": 25,
        "intelligence": 6,
        "wisdom": 13,
        "charisma": 14,
        "saving_throws": "Str +13, Dex +6, Con +13, Wis +7",
        "skills": "Perception +7",
        "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "poison",
        "condition_immunities": "poisoned",
        "senses": "darkvision 120 ft., passive Perception 17",
        "languages": "Abyssal",
        "challenge_rating": "17",
        "experience_points": 18000,
        "proficiency_bonus": 6,
        "traits": "**Charge.** If the goristro moves at least 15 feet straight toward a target and then hits it with a gore attack on the same turn, the target takes an extra 38 (7d10) piercing damage. If the target is a creature, it must succeed on a DC 21 Strength saving throw or be pushed up to 20 feet away and knocked prone.\n\n**Labyrinthine Recall.** The goristro can perfectly recall any path it has traveled.\n\n**Magic Resistance.** The goristro has advantage on saving throws against spells and other magical effects.\n\n**Siege Monster.** The goristro deals double damage to objects and structures.",
        "actions": "**Multiattack.** The goristro makes three attacks: two with its fists and one with its hoof.\n\n**Fist.** Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 18 (3d6 + 7) bludgeoning damage.\n\n**Hoof.** Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 23 (3d10 + 7) bludgeoning damage. If the target is a creature, it must succeed on a DC 21 Strength saving throw or be knocked prone.\n\n**Gore.** Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 45 (7d10 + 7) piercing damage."
      }
    },
    {
      "id": "demilich",
      "name": "Demilich",
      "img": "/game-systems/dnd5e-ogl/assets/icons/sbed/fire.svg",
      "description": "The remains of a lich that has grown bored with existence, a floating skull of immense power.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "tiny",
        "type": "undead",
        "alignment": "ne",
        "armor_class": "20 (natural armor)",
        "hp_formula": "80 (32d4)",
        "speed": "0 ft., fly 30 ft. (hover)",
        "strength": 1,
        "dexterity": 20,
        "constitution": 10,
        "intelligence": 20,
        "wisdom": 17,
        "charisma": 20,
        "saving_throws": "Con +6, Int +11, Wis +9, Cha +11",
        "damage_resistances": "bludgeoning, piercing, and slashing from magic weapons",
        "damage_immunities": "necrotic, poison, psychic; bludgeoning, piercing, and slashing from nonmagical attacks",
        "condition_immunities": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone, stunned",
        "senses": "truesight 120 ft., passive Perception 13",
        "languages": "—",
        "challenge_rating": "18",
        "experience_points": 20000,
        "proficiency_bonus": 6,
        "traits": "**Avoidance.** If the demilich is subjected to an effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.\n\n**Legendary Resistance (3/Day).** If the demilich fails a saving throw, it can choose to succeed instead.\n\n**Turn Immunity.** The demilich is immune to effects that turn undead.",
        "actions": "**Howl (Recharge 5-6).** The demilich emits a bloodcurdling howl. Each creature within 30 feet of the demilich that can hear the howl must succeed on a DC 15 Constitution saving throw or drop to 0 hit points. On a successful save, the creature is frightened until the end of its next turn.\n\n**Life Drain.** The demilich targets up to three creatures that it can see within 10 feet of it. Each target must succeed on a DC 19 Constitution saving throw or take 21 (6d6) necrotic damage, and the demilich regains hit points equal to the total damage dealt to all targets.",
        "legendary_actions": "The demilich can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The demilich regains spent legendary actions at the start of its turn.\n\n**Flight.** The demilich flies up to half its flying speed.\n\n**Cloud of Dust.** The demilich magically swirls its dusty remains. Each creature within 10 feet of the demilich, including around a corner, must succeed on a DC 15 Constitution saving throw or be blinded until the end of the demilich's next turn. A creature that succeeds on the saving throw is immune to this effect until the end of the demilich's next turn.\n\n**Energy Drain (Costs 2 Actions).** Each creature within 30 feet of the demilich must make a DC 15 Constitution saving throw. On a failed save, the creature's hit point maximum is magically reduced by 10 (3d6). If a creature's hit point maximum is reduced to 0 by this effect, the creature dies. A creature's hit point maximum can be restored with the greater restoration spell or similar magic.\n\n**Vile Curse (Costs 3 Actions).** The demilich targets one creature it can see within 30 feet of it. The target must succeed on a DC 15 Wisdom saving throw or be magically cursed. Until the curse ends, the target has disadvantage on attack rolls and saving throws. The target can repeat the saving throw at the end of each of its turns, ending the curse on a success.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the demilich can take a lair action to cause one of the following effects; the demilich can't use the same effect two rounds in a row:\n\n• The demilich rolls a d8 and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.\n\n• The demilich targets one creature it can see within 60 feet of it. An antimagic field fills the space of the target, moving with it until initiative count 20 on the next round.\n\n• The demilich targets any number of creatures it can see within 30 feet of it. No target can regain hit points until initiative count 20 on the next round."
      }
    },
    {
      "id": "balor",
      "name": "Balor",
      "img": "/game-systems/dnd5e-ogl/assets/icons/sbed/fire.svg",
      "description": "A mighty demon general wreathed in flame, wielding a flaming whip and longsword.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "huge",
        "type": "fiend (demon)",
        "alignment": "ce",
        "armor_class": "19 (natural armor)",
        "hp_formula": "262 (21d12 + 126)",
        "speed": "40 ft., fly 80 ft.",
        "strength": 26,
        "dexterity": 15,
        "constitution": 22,
        "intelligence": 20,
        "wisdom": 16,
        "charisma": 22,
        "saving_throws": "Str +14, Con +12, Wis +9, Cha +12",
        "damage_resistances": "cold, lightning; bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "fire, poison",
        "condition_immunities": "poisoned",
        "senses": "truesight 120 ft., passive Perception 13",
        "languages": "Abyssal, telepathy 120 ft.",
        "challenge_rating": "19",
        "experience_points": 22000,
        "proficiency_bonus": 6,
        "traits": "**Death Throes.** When the balor dies, it explodes, and each creature within 30 feet of it must make a DC 20 Dexterity saving throw, taking 70 (20d6) fire damage on a failed save, or half as much damage on a successful one. The explosion ignites flammable objects in that area that aren't being worn or carried, and it destroys the balor's weapons.\n\n**Fire Aura.** At the start of each of the balor's turns, each creature within 5 feet of it takes 10 (3d6) fire damage, and flammable objects in the aura that aren't being worn or carried ignite. A creature that touches the balor or hits it with a melee attack while within 5 feet of it takes 10 (3d6) fire damage.\n\n**Magic Resistance.** The balor has advantage on saving throws against spells and other magical effects.\n\n**Magic Weapons.** The balor's weapon attacks are magical.",
        "actions": "**Multiattack.** The balor makes two attacks: one with its longsword and one with its whip.\n\n**Longsword.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 21 (3d8 + 8) slashing damage plus 13 (3d8) lightning damage. If the balor scores a critical hit, it rolls damage dice three times, instead of twice.\n\n**Whip.** Melee Weapon Attack: +14 to hit, reach 30 ft., one target. Hit: 15 (2d6 + 8) slashing damage plus 10 (3d6) fire damage, and the target must succeed on a DC 20 Strength saving throw or be pulled up to 25 feet toward the balor.\n\n**Teleport.** The balor magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
      }
    },
    {
      "id": "ancient-brass-dragon",
      "name": "Ancient Brass Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "An ancient metallic dragon that loves conversation and dwells in hot, arid regions.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "dragon",
        "alignment": "cg",
        "armor_class": "20 (natural armor)",
        "hp_formula": "297 (17d20 + 119)",
        "speed": "40 ft., burrow 40 ft., fly 80 ft.",
        "strength": 27,
        "dexterity": 10,
        "constitution": 25,
        "intelligence": 16,
        "wisdom": 15,
        "charisma": 19,
        "saving_throws": "Dex +6, Con +13, Wis +8, Cha +10",
        "skills": "History +9, Perception +14, Persuasion +10, Stealth +6",
        "damage_immunities": "fire",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 24",
        "languages": "Common, Draconic",
        "challenge_rating": "20",
        "experience_points": 25000,
        "proficiency_bonus": 6,
        "traits": "**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage.\n\n**Claw.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\n**Tail.** Melee Weapon Attack: +14 to hit, reach 20 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Breath Weapons (Recharge 5-6).** The dragon uses one of the following breath weapons:\n\n**Fire Breath.** The dragon exhales fire in a 90-foot line that is 10 feet wide. Each creature in that line must make a DC 21 Dexterity saving throw, taking 56 (16d6) fire damage on a failed save, or half as much damage on a successful one.\n\n**Sleep Breath.** The dragon exhales sleep gas in a 90-foot cone. Each creature in that area must succeed on a DC 21 Constitution saving throw or fall unconscious for 10 minutes. This effect ends for a creature if the creature takes damage or someone uses an action to wake it.\n\n**Change Shape.** The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice). In a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3
      }
    },
    {
      "id": "ancient-white-dragon",
      "name": "Ancient White Dragon",
      "img": "/game-systems/dnd5e-ogl/assets/icons/lorc/sea-dragon.svg",
      "description": "An ancient chromatic dragon that dwells in icy wastes, the most feral of dragons.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "gargantuan",
        "type": "dragon",
        "alignment": "ce",
        "armor_class": "20 (natural armor)",
        "hp_formula": "333 (18d20 + 144)",
        "speed": "40 ft., burrow 40 ft., fly 80 ft., swim 40 ft.",
        "strength": 26,
        "dexterity": 10,
        "constitution": 26,
        "intelligence": 10,
        "wisdom": 13,
        "charisma": 14,
        "saving_throws": "Dex +6, Con +14, Wis +7, Cha +8",
        "skills": "Perception +13, Stealth +6",
        "damage_immunities": "cold",
        "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23",
        "languages": "Common, Draconic",
        "challenge_rating": "20",
        "experience_points": 25000,
        "proficiency_bonus": 6,
        "traits": "**Ice Walk.** The dragon can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement.\n\n**Legendary Resistance (3/Day).** If the dragon fails a saving throw, it can choose to succeed instead.",
        "actions": "**Multiattack.** The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 9 (2d8) cold damage.\n\n**Claw.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage.\n\n**Tail.** Melee Weapon Attack: +14 to hit, reach 20 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.\n\n**Frightful Presence.** Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.\n\n**Cold Breath (Recharge 5-6).** The dragon exhales an icy blast in a 90-foot cone. Each creature in that area must make a DC 22 Constitution saving throw, taking 72 (16d8) cold damage on a failed save, or half as much damage on a successful one.",
        "legendary_actions": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\n**Detect.** The dragon makes a Wisdom (Perception) check.\n\n**Tail Attack.** The dragon makes a tail attack.\n\n**Wing Attack (Costs 2 Actions).** The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
        "legendary_actions_per_round": 3,
        "lair_actions": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n• Freezing fog fills a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The fog spreads around corners, and its area is heavily obscured. Each creature in the fog when it appears must make a DC 10 Constitution saving throw, taking 10 (3d6) cold damage on a failed save, or half as much damage on a successful one. A creature that ends its turn in the fog takes 10 (3d6) cold damage. A wind of at least 20 miles per hour disperses the fog. The fog otherwise lasts until the dragon uses this lair action again or until the dragon dies.\n\n• Jagged ice shards fall from the ceiling, striking up to three creatures underneath that the dragon can see within 120 feet of it. The dragon makes one ranged attack roll (+7 to hit) against each target. On a hit, the target takes 10 (3d6) piercing damage.\n\n• The dragon creates an opaque wall of ice on a solid surface it can see within 120 feet of it. The wall can be up to 30 feet long, 30 feet high, and 1 foot thick. When the wall appears, each creature within its area is pushed 5 feet out of the wall's space, appearing on whichever side of the wall it wants. Each 10-foot section of the wall has AC 5, 30 hit points, vulnerability to fire damage, and immunity to acid, cold, necrotic, poison, and psychic damage. The wall disappears when the dragon uses this lair action again or when the dragon dies.",
        "regional_effects": "The region containing a legendary white dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n• Chilly fog lightly obscures the land within 6 miles of the dragon's lair.\n\n• Freezing precipitation falls within 6 miles of the dragon's lair, sometimes forming blizzard conditions when the dragon is at rest.\n\n• Icy walls block off areas in the dragon's lair. Each wall is 6 inches thick, and a 10-foot section has AC 5, 15 hit points, vulnerability to fire damage, and immunity to acid, cold, necrotic, poison, and psychic damage.\n\nIf the dragon wishes to move through a wall, it can do so without slowing down. The portion of the wall the dragon moves through is destroyed, however.\n\nIf the dragon dies, the fog and precipitation fade within 1 day. The ice walls melt over the course of 1d10 days."
      }
    },
    {
      "id": "pit-fiend",
      "name": "Pit Fiend",
      "img": "/game-systems/dnd5e-ogl/assets/icons/sbed/fire.svg",
      "description": "The most powerful of devils, generals of the Nine Hells wreathed in flame and fury.",
      "templateId": "dnd5e-monster",
      "source": "SRD 5.1",
      "data": {
        "size": "large",
        "type": "fiend (devil)",
        "alignment": "le",
        "armor_class": "19 (natural armor)",
        "hp_formula": "300 (24d10 + 168)",
        "speed": "30 ft., fly 60 ft.",
        "strength": 26,
        "dexterity": 14,
        "constitution": 24,
        "intelligence": 22,
        "wisdom": 18,
        "charisma": 24,
        "saving_throws": "Dex +8, Con +13, Wis +10",
        "damage_resistances": "cold; bludgeoning, piercing, and slashing from nonmagical attacks that aren't silvered",
        "damage_immunities": "fire, poison",
        "condition_immunities": "poisoned",
        "senses": "truesight 120 ft., passive Perception 14",
        "languages": "Infernal, telepathy 120 ft.",
        "challenge_rating": "20",
        "experience_points": 25000,
        "proficiency_bonus": 6,
        "traits": "**Fear Aura.** Any creature hostile to the pit fiend that starts its turn within 20 feet of the pit fiend must make a DC 21 Wisdom saving throw, unless the pit fiend is incapacitated. On a failed save, the creature is frightened until the start of its next turn. If a creature's saving throw is successful, the creature is immune to the pit fiend's Fear Aura for the next 24 hours.\n\n**Magic Resistance.** The pit fiend has advantage on saving throws against spells and other magical effects.\n\n**Magic Weapons.** The pit fiend's weapon attacks are magical.\n\n**Innate Spellcasting.** The pit fiend's spellcasting ability is Charisma (spell save DC 21). The pit fiend can innately cast the following spells, requiring no material components:\n\nAt will: detect magic, fireball\n3/day each: hold monster, wall of fire",
        "actions": "**Multiattack.** The pit fiend makes four attacks: one with its bite, one with its claw, one with its mace, and one with its tail.\n\n**Bite.** Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 22 (4d6 + 8) piercing damage. The target must succeed on a DC 21 Constitution saving throw or become poisoned. While poisoned in this way, the target can't regain hit points, and it takes 21 (6d6) poison damage at the start of each of its turns. The poisoned target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n**Claw.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 17 (2d8 + 8) slashing damage.\n\n**Mace.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) bludgeoning damage plus 21 (6d6) fire damage.\n\n**Tail.** Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 24 (3d10 + 8) bludgeoning damage."
      }
    }
  ]
}